In [2]:
#Importing pandas module
import pandas as pd

In [3]:
#Loading all the csv files into different pandas dataframe.
df1=pd.read_csv("iphone6.csv")
df2=pd.read_csv("iphone11.csv")
df3=pd.read_csv("pocof1steel.csv")

In [4]:
df1.head()

   ratings                                             review
0      4.0  i been using this beauty for last 6 days, orde...
1      4.0  i been using this beauty for last 6 days, orde...
2      4.0  i been using this beauty for last 6 days, orde...
3      5.0  1st of all guys i don't believe in online shop...
4      5.0  Super class phone display awesome sounds aweso...

In [5]:
df2.head()

   ratings                                             review
0        5  This is my first ever I phone. Before this I w...
1        5  This is my first ever I phone. Before this I w...
2        5  This is my first ever I phone. Before this I w...
3        5  This is my first ever I phone. Before this I w...
4        5  This is my first ever I phone. Before this I w...

In [6]:
df3.head()

   ratings                                             review
0      5.0  Excellent Phone With Excellent Camera. Perform...
1      5.0  Excellent Phone With Excellent Camera. Perform...
2      5.0  Excellent Phone With Excellent Camera. Perform...
3      5.0  Excellent Phone With Excellent Camera. Perform...
4      5.0  I brought this phone in March 2019 just becaus...

In [7]:
#Removing duplicates records present in the dataframe,resetting the index.
df1=df1.drop_duplicates(keep='first')
df1 = df1.reset_index()
df1=df1.drop(['index'], axis = 1)

In [8]:
#Removing duplicates records present in the dataframe,resetting the index.
df2=df2.drop_duplicates(keep='first')
df2 = df2.reset_index()
df2=df2.drop(['index'], axis = 1)

In [9]:
#Removing duplicates records present in the dataframe,resetting the index.
df3=df3.drop_duplicates(keep='first')
df3= df3.reset_index()
df3=df3.drop(['index'], axis = 1)

In [10]:
df1.shape

(840, 2)

In [11]:
df2.shape

(522, 2)

In [12]:
df3.shape

(968, 2)

In [13]:
#Concatenating all the three dataframes into a single dataframe.
frames=[df1,df2,df3]
result=pd.concat(frames)

In [14]:
#Resetting the index column of the dataframe.
result= result.reset_index()

In [15]:
result=result.drop(['index'], axis = 1)

In [16]:
#Converting the dataframe into a csv file.
result.to_csv("new_mobile.csv")

In [17]:
result

      ratings                                             review
0         4.0  i been using this beauty for last 6 days, orde...
1         5.0  1st of all guys i don't believe in online shop...
2         5.0  Super class phone display awesome sounds aweso...
3         5.0  On this purchase I got great deal with flipkar...
4         4.0  i love the size of this phone. it camera is go...
...       ...                                                ...
2325      4.0                     affordable phone in good price
2326      5.0                         very very bad mobile phone
2327      5.0             Good product, excellent phone.........
2328      5.0                   Experience Pubg in high graphics
2329      NaN                                                NaN

[2330 rows x 2 columns]